[
  {
    "id": 1,
    "is_censured": false,
    "name": "Initiation à Angular : Développez vos Premiers Applications Web",
    "slug": "initiation-a-angular-developpez-vos-premiers-applications-web",
    "subject": "Développement Web",
    "level": "Débutant",
    "duration": 120,
    "description": "<p>Bienvenue dans ce cours complet d’initiation à Angular, le framework JavaScript populaire pour créer des applications web dynamiques. Ce cours est destiné aux débutants qui souhaitent acquérir les compétences nécessaires pour bâtir leurs premières applications web avec Angular.</p><p>Au fil des modules, vous découvrirez ce qu'est Angular et comment il fonctionne, vous apprendrez à créer des composants, gérer la navigation et les routes, ainsi que travailler avec des services pour communiquer avec les API.</p><p>Pour suivre ce cours, vous n'avez pas besoin d'expérience préalable en développement web, mais une connaissance de base de HTML, CSS et JavaScript serait un plus. À la fin de ce parcours, vous serez en mesure de développer une application web simple et de comprendre les principaux concepts d'Angular.</p><p><strong>Compétences acquises :</strong></p><ul><li>Comprendre l'architecture d'une application Angular.</li><li>Créer et gérer des composants Angular.</li><li>Gérer la navigation et les routes dans une application.</li><li>Consommer des API à l'aide de services Angular.</li></ul>",
    "course_outline": [
      {
        "title": "Introduction à Angular",
        "abstract": "Découvrez les fondamentaux d'Angular, son architecture et pourquoi il est largement utilisé pour le développement web.",
        "duration": 30,
        "pedagogical_objectives": "Comprendre ce qu'est Angular, son architecture, et identifier les cas d'utilisation."
      },
      {
        "title": "Création de composants et templates",
        "abstract": "Apprenez à créer des composants Angular et à les utiliser efficacement dans vos applications grâce aux templates.",
        "duration": 40,
        "pedagogical_objectives": "Savoir créer des composants réutilisables et travailler avec des templates Angular."
      },
      {
        "title": "Gestion de la navigation avec Angular Router",
        "abstract": "Maîtrisez la navigation dans votre application grâce à Angular Router, et apprenez à gérer les différentes routes.",
        "duration": 50,
        "pedagogical_objectives": "Comprendre comment configurer les routes et naviguer entre différentes vues."
      }
    ],
    "course_steps_content": [
      {
        "title": "Introduction à Angular",
        "parts": [
          {
            "subtitle": "Qu'est-ce qu'Angular ?",
            "content": "<p>Angular est un framework de développement web open-source développé par Google. Il permet de construire des applications web dynamiques et performantes grâce à la création de composants modulaires.</p><p><strong>Architecture Angular</strong></p><p>Angular repose sur le DOM virtuel, une approche qui optimise les mises à jour de l'interface utilisateur. Les principales parties qui composent une application Angular sont :</p><ul><li>Modules : contiennent des composants, services, et d'autres fonctionnalités.</li><li>Composants : les briques de base qui gèrent les vues et le comportement de l'application.</li><li>Services : gèrent la logique métier, comme les appels API.</li></ul><p>Dans ce module, vous apprendrez à créer votre première application Angular, en utilisant le CLI (Command Line Interface).</p>",
            "to_remember": "Angular est un framework basé sur des composants, permettant de construire des applications web dynamiques.",
            "resources": "<a href=\"https://angular.io/docs\" target=\"_blank\" rel=\"noopener noreferrer\">Documentation officielle d'Angular</a>"
          }
        ]
      }
    ]
  }
]